def normalize_text(text: str) -> str:
    text = text.lower()

    replacements = {
 	"समय": "समय",
        "तारीख": "तारीख",
        "मौसम": "मौसम",
        "तापमान": "तापमान",
        "लाइट": "लाइट",
        "पोषण": "पोषण",
        "पोषक": "पोषक",
        "सो": "सो",
        "जागो": "जागो",
        # Hinglish phonetic verbs
        "बताओ": "बताओ",
        "बोलो": "बताओ",
        "क्या": "क्या",
        "करो": "करो",
        "बंद": "बंद",
        "चालू": "चालू",
        "जलाओ": "जलाओ",
        "बुझाओ": "बुझाओ",
        "तेज": "तेज",
        "कम": "कम",
        "आज": "आज",
        "अभी": "अभी",
        "महीने": "महीने",
        "दिन": "दिन"
    }

    for src, tgt in replacements.items():
        text = text.replace(src, tgt)

    return text.strip()

